Tekla.Structures.Drawing.Surfacing.Representation
The surfacing representations.

Tekla.Structures.Drawing.Surfacing.Representation.Outline
The outline representation.

Tekla.Structures.Drawing.Surfacing.Representation.Symbol
The symbol representation.

Tekla.Structures.Drawing.Surfacing.Representation.WorkshopForm
The workshop form representation.

Tekla.Structures.Drawing.Surfacing.Representation.Exact
The exact representation.

Tekla.Structures.Drawing.Surfacing.Representation.BoundingBox
The bounding box representation.

Tekla.Structures.Drawing.Surfacing.Representation.BaseBox
The base box representation.